-- phpMyAdmin SQL Dump
-- version 5.2.3
-- https://www.phpmyadmin.net/
--
-- Host: temp-mysql
-- Generation Time: Dec 23, 2025 at 05:56 PM
-- Server version: 8.0.44
-- PHP Version: 8.3.26

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `jstaorg_members`
--

-- --------------------------------------------------------

--
-- Table structure for table `jobtitle`
--

CREATE TABLE `jobtitle` (
  `id` int NOT NULL,
  `name` varchar(128) NOT NULL,
  `nameAR` varchar(128) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8mb3;

--
-- Dumping data for table `jobtitle`
--

INSERT INTO `jobtitle` (`id`, `name`, `nameAR`) VALUES
(1, 'شريك', 'شريك'),
(2, 'مالك', 'مالك'),
(3, 'رئيس مجلس الادارة', 'رئيس مجلس الادارة'),
(4, 'نائب الرئيس', 'نائب الرئيس'),
(5, 'مدير عام', 'مدير عام'),
(6, 'نائب المدير العام', 'نائب المدير العام'),
(7, 'مساعد المدير العام', 'مساعد المدير العام'),
(8, 'مدير مالي', 'مدير مالي'),
(9, 'مساعد مدير مالي', 'مساعد مدير مالي'),
(10, 'محاسب', 'محاسب'),
(11, 'محاسب جزئي', 'محاسب جزئي'),
(12, 'محاسب رئيسي', 'محاسب رئيسي'),
(13, 'مندوب مطار', 'مندوب مطار'),
(14, 'مندوب', 'مندوب'),
(15, 'سياحة صادرة', 'سياحة صادرة'),
(16, 'مدير سياحة صادرة', 'مدير سياحة صادرة'),
(17, 'حجوزات', 'حجوزات'),
(18, 'مدير حجوزات', 'مدير حجوزات'),
(19, 'حجز ومبيعات', 'حجز ومبيعات'),
(20, 'مدير حجز ومبيعات', 'مدير حجز ومبيعات'),
(21, 'مبيعات', 'مبيعات'),
(22, 'تسويق', 'تسويق'),
(23, 'مدير تسويق', 'مدير تسويق'),
(24, 'مدير مبيعات', 'مدير مبيعات'),
(25, 'تسويق ومبيعات', 'تسويق ومبيعات'),
(26, 'مدير تسويق ومبيعات', 'مدير تسويق ومبيعات'),
(27, 'علاقات عامة', 'علاقات عامة'),
(28, 'مدير علاقات عامة', 'مدير علاقات عامة'),
(29, 'موظف إداري', 'موظف إداري'),
(30, 'سكرتاريا', 'سكرتاريا'),
(31, 'سياحة واردة', 'سياحة واردة'),
(32, 'مدير سياحة واردة', 'مدير سياحة واردة'),
(33, 'رحلات داخلية', 'رحلات داخلية'),
(34, 'مدير السياحة', 'مدير السياحة'),
(35, 'حجز ومبيعات تذاكر', 'حجز ومبيعات تذاكر'),
(36, 'حجز ومبيعات برامج سياحية', 'حجز ومبيعات برامج سياحية'),
(37, 'حجوزات حج وعمرة', 'حجوزات حج وعمرة'),
(38, 'موظف IT', 'موظف IT'),
(39, 'مدخل بيانات', 'مدخل بيانات'),
(40, 'عمليات', 'عمليات'),
(41, 'مدير تطوير الاعمال', 'مدير تطوير الاعمال'),
(42, 'شؤون موظفين', 'شؤون موظفين'),
(43, 'مدير شؤون موظفين', 'مدير شؤون موظفين'),
(44, 'عضو هيئة إدارية', 'عضو هيئة إدارية'),
(45, 'مراسل', 'مراسل'),
(46, 'مدير مكتب', 'مدير مكتب'),
(47, 'مدير عمليات', 'مدير عمليات'),
(49, 'مفوض	', 'مفوض'),
(50, 'مدير فرع ', 'مدير فرع '),
(51, 'سائق', 'سائق '),
(52, 'موظف استقبال ', 'موظف استقبال'),
(53, 'محصل', 'محصل'),
(54, 'معقب معاملات', 'معقب معاملات');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `jobtitle`
--
ALTER TABLE `jobtitle`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `jobtitle`
--
ALTER TABLE `jobtitle`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=55;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
